Autodesk.Revit.DB.Reference.Refresh
Attempts to refresh the geometry object stored in this reference.
Remarks: After a change has been made to Revit geometry, the stored geometry object in
a Reference handle may become invalid.  This method attempts to re-obtain the geometry
object from the current geometry.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Unable to refresh geometry object for this Reference.
This may be because the geometry object referred to no longer exists in the current Revit geometry.

Autodesk.Revit.DB.Reference.Contains(Autodesk.Revit.DB.Reference)
Checks if given reference identifies part of object identified by this reference.
Remarks:
Can be used to check:
If given Reference is a part of a particular Subelement identified by this Reference.If given Reference is a part of a particular Element identified by this Reference.
The input reference can refer to a subelement or a specific geometric item from an element or subelement.
reference: Another reference.
Returns: Returns true if given reference identifies part of object identified by this reference, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.
Since: 2018

Autodesk.Revit.DB.Reference.EqualTo(Autodesk.Revit.DB.Reference)
Checks if given reference is equal to this reference.
reference: Another reference.
Returns: Returns true if given reference is equal to this reference, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.
Since: 2018

Autodesk.Revit.DB.Reference.ParseFromStableRepresentation(Autodesk.Revit.DB.Document,System.String)
Converts a stable String representation of a reference to a Reference object.
Remarks: Use Autodesk.Revit.DB.Reference.ConvertToStableRepresentation(Autodesk.Revit.DB.Document) to obtain the representation.
The Reference will have only the following information set:
Autodesk.Revit.DB.Reference.ElementReferenceTypeAutodesk.Revit.DB.Reference.ElementId
You will also be able to pass the reference to Document.GetElement(reference) and Element.GetGeometryObjectFromReference(reference)
to obtain the element and geometry object referred to.
document: The document.
representation: The reference representation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: One or more arguments was null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Reference representation could not be successfully parsed, or element id obtained
from reference representation could not be found in this document.

Autodesk.Revit.DB.Reference.ConvertToStableRepresentation(Autodesk.Revit.DB.Document)
Converts the reference to a stable String representation.
Remarks: The stable representation can be used to preserve and restore the reference later in the
same Revit session or even in a different session where the same document is present.  Use
Autodesk.Revit.DB.Reference.ParseFromStableRepresentation(Autodesk.Revit.DB.Document,System.String) to restore the reference.
The representation is based on the internal Revit structure and is not intended to be parsed expect by
Autodesk.Revit.DB.Reference.ParseFromStableRepresentation(Autodesk.Revit.DB.Document,System.String).
document: The document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: document was null.
Throws Autodesk.Revit.Exceptions.InvalidObjectException: Reference contained element ids not found in this document.

Autodesk.Revit.DB.Reference.UVPoint
The UV parameters of the reference, if the reference contains a face.
Remarks: This value is valid only for references of type REFERENCE_TYPE_SURFACE.
It is null for all other types.

Autodesk.Revit.DB.Reference.GlobalPoint
The position on which the reference is hit.
Remarks: When using a plan view, the Z-value of a GlobalPoint is not meaningful.
Returns:
null if the reference doesn't have a global point.

Autodesk.Revit.DB.Reference.ElementReferenceType
The type of reference.

Autodesk.Revit.DB.Reference.LinkedElementId
The id of the top-level element in the linked document that is referred to by this reference.
Remarks: InvalidElementId will be returned for references that don't refer to an element in a linked RVT file.
Since: 2014

Autodesk.Revit.DB.Reference.ElementId
The element id for this reference.
Remarks: InvalidElementId will be returned for references that don't refer to a particular element.
Since: 2012

Autodesk.Revit.DB.Reference.CreateReferenceInLink
Creates a Reference in an RVT Link from a Reference in the RVT host file.
Since: 2014

Autodesk.Revit.DB.Reference.CreateLinkReference(Autodesk.Revit.DB.RevitLinkInstance)
Creates a Reference from a Reference in an RVT Link.
revitLinkInstance: Id of the RevitLinkInstance that contains the reference.
Remarks: The reference that is returned can be used to create a family instance on a face in an RVT link.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when revitLinkInstance is null.
Since: 2014

Autodesk.Revit.DB.Reference.#ctor(Autodesk.Revit.DB.Element)
Creates a Reference with the supplied element.
element: The element to create a reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the parameter is null.
Since: 2011

Autodesk.Revit.DB.Reference
A stable reference to a geometric object in a Revit model.